{
  "home": [
    {
      "title": "Personal",
      "description": "The hustle and bustle of this lively city never seems to tire me! I lived in Mumbai for close to 10 years and in spite of the streets being overcrowded, the city felt like the perfect place. As people fondly call it 'the city of dreams', it lives up to its name while offering a variety of life experiences."
    },
    {
      "title": "Introduction",
      "description": "Mumbai, the capital city of the Indian state of Maharashtra, is a spectacular paradox of chaos and hope, glamour and squalor, modernity and tradition. Famously known as the City of Dreams, Mumbai – formerly known as Bombay - is a beautifully blended melting pot of cultures and lifestyles. The city soaks in everything into its fabric, making it its very own. From upcoming actors struggling to make it big on the silver screen; from Bolly superstars to big industrialists to tribes of fisherman and slum dwellers, Mumbai is a city that proudly boasts of stories from different walks of human survival. One of the main centres in the country of art, culture, music, dance and theatre, Mumbai is a dynamic, cosmopolitan city that has been running for years solely on the indomitable spirit of the 'Mumbaikars'."
    },
    {
      "title": "History",
      "description": "The history of the city of Mumbai, or Bombay, began with the signing of the Treaty of Bassein between Sultan Bahadur Shah of Gujarat and the Portuguese, who were offered the seven islands that made up Bombay by the Sultan. The islands were initially referred to by several different names, but collectively took the written name of Bombain. The Portuguese built several churches and forts in the city during their reign. With its growing strategic importance as a natural harbour, it attracted repeated British and Dutch interests. In 1661, as part of the royal marriage alliance between Charles II of England and Princess Catherine of Portugal, the islands were given as dowry to the British by the Portuguese. In 1668, the English leased 3 of the islands to the British East India Company, and a few years later, they shifted their capital from Surat to Bombay. Bombay was thus the capital of the Bombay Presidency and quickly gained commercial and military significance. The Portuguese finally left Bombay in the 1730s, following their defeat to the Marathas under Peshwa Baji Rao. Following the Anglo-Maratha war and the signing of some treaties, the British drove out the Marathas and were able to establish their majoritarian supremacy over Bombay. Under the Hornby Vellard project, the islands were unified through significant land reclamation activities into a single landmass. Bombay was extremely active in the political sphere during India’s independence struggle and was part of the Quit India Movement & the Royal Navy Mutiny in the 1940s."
    },
    {
      "title": "Financial Capital",
      "description": "Following the establishment of Bombay as the capital of the English East India Company in 1687, and after the opening of the Suez Canal in 1869, there has been no stopping the rapid growth of the city of Bombay or Mumbai. Mumbai is the commercial and financial capital of India and contributes to 6.6% of India’s Gross Domestic Product. Initially, the primary contributors to Mumbai’s revenues were the textile mills and the seaport, but following the Indian economy liberalisation in 1991, there has been an increasing growth in finance, IT, engineering as well as gems and stone. Many Fortune 500 companies have their headquarters in Mumbai, as do important financial institutions like the Reserve Bank of India, the Bombay Stock Exchange and the Securities and Exchange Board of India, among others. Mumbai was ranked the third most expensive office market in the world in 2009, and 7th in Forbes’s list of Top 10 Cities for Billionaires, and the 1st regarding their average wealth in 2008."
    },
    {
      "title": "Architecture",
      "description": "The city of Mumbai has a richly diverse and delightful palate of architectural styles. The buildings constructed during the colonial period, such as the Victoria Terminus, are built in the Gothic-revival style and have a European blend including German gables, Dutch roofs and Tudor casements. In South Mumbai, there are many offices and buildings of the Soviet style.The famous Gateway of India is constructed in the Indo-Saracenic style, while landmarks along Marine Drive are modelled along the Art-Deco lines. After Miami, Mumbai hosts the most number of constructions in the Art-Deco style. Mumbai is also famous for contemporary and modern architecture and has the most number of skyscrapers in India. The Chhatrapati Shivaji Terminus and the Elephanta Caves of Mumbai are UNESCO World Heritage Sites."
    },
    {
      "title": "Attractions",
      "description": "Apart  from being the capital of Maharashtra, Mumbai is the commercial capital of India, owing to the infinite services and industries present here. Besides being home to the largest cinema industry in the world, Mumbai, like Kolkata, has its own distinct culture. If you don't believe it, visit the city during festivals like Diwali, Ganesh Chaturthi, Navaratri etc. and your doubts shall be dispelled for sure. Be it the majestic charm of the colonial heritage, like the Taj Mahal Palace and Tower, or the indigenous beauty of places like Siddhivinayak Mandir, Wankhede Stadium to name a few, Mumbai is one city that never ceases to surprise you. Mumbai is a literal paradise for any foodie, owing to the exquisite range of cuisine, be it the luscious 'Missal Pav' or the lovely Parsi cuisine in some of the heritage cafes."
    }
  ],
  "credits": {
    "images": [
      {
        "imageName": "Menu Icon",
        "imageIcon": "../assets/images/menuIcon.png",
        "imageUrl": "https://www.flaticon.com/free-icon/menu_483334?term=menu%20icon&page=1&position=3#",
        "imageLocation": "This icon shows up on small screen sizes on the header, when the navigation bar options collapse and are available under the hamburger menu icon."
      },
      {
        "imageName": "Juhu Beach",
        "imageIcon": "../assets/images/beach.jpg",
        "imageUrl": "https://wallpapercave.com/w/wp3768679",
        "imageLocation": "This is one of the images in the composition of four images on the Home Page."
      },
      {
        "imageName": "Worli Sea Link",
        "imageIcon": "../assets/images/worliSeaLink.jpg",
        "imageUrl": "https://wallpapercave.com/w/wp3768667",
        "imageLocation": "This is one of the images in the composition of four images on the Home Page."
      },
      {
        "imageName": "Marine Drive",
        "imageIcon": "../assets/images/marineDrive.jpg",
        "imageUrl": "https://wallpapercave.com/w/wp3768669",
        "imageLocation": "This is one of the images in the composition of four images on the Home Page."
      },
      {
        "imageName": "Gateway of India",
        "imageIcon": "../assets/images/gatewayOfIndia.jpg",
        "imageUrl": "https://wallpapercave.com/w/wp3768687",
        "imageLocation": "This is one of the images in the composition of four images on the Home Page."
      },
      {
        "imageName": "Weather Icon - Clear Day",
        "imageIcon": "../assets/images/weatherIcons/clear_day.png",
        "imageUrl": "https://www.flaticon.com/free-icon/sunny-day_72643?term=clear%20day&page=1&position=1#",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a clear day."
      },
      {
        "imageName": "Weather Icon - Clear Night",
        "imageIcon": "../assets/images/weatherIcons/clear_night.png",
        "imageUrl": "https://www.flaticon.com/free-icon/clear-night_17279?term=clear%20night&page=1&position=5",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a clear night."
      },
      {
        "imageName": "Weather Icon - Rain",
        "imageIcon": "../assets/images/weatherIcons/rain.png",
        "imageUrl": "https://www.flaticon.com/free-icon/rain_652572?term=rain&page=1&position=4",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a rainy day."
      },
      {
        "imageName": "Weather Icon - Snow",
        "imageIcon": "../assets/images/weatherIcons/snow.png",
        "imageUrl": "https://www.flaticon.com/free-icon/snowflake_1200430?term=snow&page=1&position=12",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a snowy day."
      },
      {
        "imageName": "Weather Icon - Sleet",
        "imageIcon": "../assets/images/weatherIcons/sleet.png",
        "imageUrl": "https://www.flaticon.com/free-icon/sleet_727907?term=sleet&page=1&position=6",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a day with sleet."
      },
      {
        "imageName": "Weather Icon - Wind",
        "imageIcon": "../assets/images/weatherIcons/wind.png",
        "imageUrl": "https://www.flaticon.com/free-icon/wind_1506761?term=wind&page=1&position=15",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a windy day."
      },
      {
        "imageName": "Weather Icon - Fog",
        "imageIcon": "../assets/images/weatherIcons/fog.png",
        "imageUrl": "https://www.flaticon.com/free-icon/foggy_1809565?term=fog&page=1&position=13",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a foggy day."
      },
      {
        "imageName": "Weather Icon - Cloudy",
        "imageIcon": "../assets/images/weatherIcons/cloudy.png",
        "imageUrl": "https://www.flaticon.com/free-icon/clouds_414927?term=cloudy&page=1&position=6",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a cloudy day."
      },
      {
        "imageName": "Weather Icon - Partly Cloudy Day",
        "imageIcon": "../assets/images/weatherIcons/partly_cloudy_day.png",
        "imageUrl": "https://www.flaticon.com/free-icon/sun_2698213?term=cloudy&page=1&position=10",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a partly cloudy day."
      },
      {
        "imageName": "Weather Icon - Partly Cloudy Night",
        "imageIcon": "../assets/images/weatherIcons/partly_cloudy_night.png",
        "imageUrl": "https://www.flaticon.com/free-icon/cloudy_414933?term=cloudy%20night&page=1&position=9",
        "imageLocation": "This image is shown as an icon on the Weather Page depending on whether the real-time data suggests the climate as a partly cloudy night."
      },
      {
        "imageName": "Mumbai Skyline",
        "imageIcon": "../assets/images/mumbaiSkyline.png",
        "imageUrl": "https://www.vexels.com/vectors/preview/144393/mumbai-silhouette-skyline",
        "imageLocation": "This image is used in the background of the footer and the opacity of this image has been reduced."
      }
    ],
    "text": [
      {
        "textName": "Information about Mumbai",
        "textUrl": "https://www.holidify.com/places/mumbai/",
        "textLocation": "This text is used on the Home Page of the website."
      },
      {
        "textName": "Location of Mumbai on the map (API)",
        "textUrl": "https://darksky.net/dev/docs",
        "textLocation": "This data (map) is displayed on the Location Page of the website."
      },
      {
        "textName": "Real-time Weather Data (API)",
        "textUrl": "https://darksky.net/dev/docs",
        "textLocation": "This data is displayed on the Weather Page of the website."
      }
    ]
  },
  "location": {
    "restaurantMarkers": [
      {
        "position": {
          "latitude": 19.0612649,
          "longitude": 72.9067792
        },
        "title": "Lucky Restaurant",
        "message": "Lucky Restaurant"
      },
      {
        "position": {
          "latitude": 18.921778,
          "longitude": 72.83328483
        },
        "title": "Taj Mahal Hotel",
        "message": "Taj Mahal Hotel"
      },
      {
        "position": {
          "latitude": 19.1039441,
          "longitude": 72.86975364
        },
        "title": "ITC Grand Maratha",
        "message": "ITC Grand Maratha"
      },
      {
        "position": {
          "latitude": 18.9279453,
          "longitude": 72.8321691
        },
        "title": "Punjab Grill",
        "message": "Punjab Grill"
      },
      {
        "position": {
          "latitude": 19.0602239,
          "longitude": 72.8343003
        },
        "title": "Moti Mahal",
        "message": "Moti Mahal"
      }
    ],
    "touristMarkers": [
      {
        "position": {
          "latitude": 18.9225882,
          "longitude": 72.8343336
        },
        "title": "Gateway of India",
        "message": "Gateway of India"
      },
      {
        "position": {
          "latitude": 18.9414868,
          "longitude": 72.8238464
        },
        "title": "Marine Drive",
        "message": "Marine Drive"
      },
      {
        "position": {
          "latitude": 19.09606785,
          "longitude": 72.82753945
        },
        "title": "Juhu Beach",
        "message": "Juhu Beach"
      },
      {
        "position": {
          "latitude": 19.01687745,
          "longitude": 72.83040036
        },
        "title": "Siddhivinayak Temple",
        "message": "Siddhivinayak Temple"
      },
      {
        "position": {
          "latitude": 19.2253824,
          "longitude": 72.8080979
        },
        "title": "Essel World",
        "message": "Essel World"
      }
    ]
  }
}
